org-content/all-posts.org
# -*- mode: org; mode: visual-line; mode: visual-fill-column; mode: org-hugo-auto-export -*-
#+hugo_section: post/
#+hugo_base_dir: ../
#+export_hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+startup: inlineimages
#+startup: logdone
#+property: header-args:sql :session reporter :exports result :colnames yes  :engine postgresql :results replace table
#+hugo_paired_shortcodes: %table %marginnote %newthought
#+macro: newthought @@hugo:{{% newthought %}}@@$1@@hugo:{{% /newthought %}}@@
#+macro: marginnote @@hugo:{{% marginnote %}}@@$1@@hugo:{{% /marginnote %}}@@
#+macro: sc @@hugo:{{% $1 %}}@@
#+macro: <sc @@hugo:{{< $1 >}}@@

#+seq_todo: TODO DRAFT DONE

** DONE My Virtual Gig-Like Thing
:PROPERTIES:
:export_hugo_slug: virtual-gig-like-thing
:export_date: 2020-04-08T00:00:00
:EXPORT_FILE_NAME: virtual-gig-like-thing
:ID:       C2642DFD-B4E8-44DB-B576-BED6A8C96223
:END:

On Thursday the 9th of April at 7pm UK time, I'm streaming my first attempt
at a  full folk club style gig from my study to my
Twitch stream]] and I would  love for you to be there.


*** Schedule
   :PROPERTIES:
   :ID:       6769254B-F1F3-46DF-814F-63D96F985D7C
   :END:

It all kicks off at 7pm, UK time with a kind of Q&A session and
introduction to Twitch for newcomers. I'm particurly planning to help
other independent musicians reach their audience through the platform.@@hugo:{{% marginnote %}}@@Recent deals with [[https://soundcloud.com][SoundCloud]] have made it /much/ easier for experienced
performers to access the means to get paid on Twitch, and it seems to be
the most transparent platform for getting paid.@@hugo:{{% /marginnote %}}@@


Then, I plan to follow the Royal Traditions/Singing Together format of two
forty minute sets of folk material with a 10 minute refreshment and raffle
break in the middle.

After the folk club concert I'll be jumping onto [[https://twitch.tv/sings/download/][Twitch Sings]] to round out
the evening singing implausible songs with friends from that community and
any folky friends who've managed to get themselves up on Twitch by then. I'm
hoping it'll be a lot of fun.


*** Ticket Prices
   :PROPERTIES:
   :ID:       0E43DD7E-5512-435C-B7C4-73910B049C75
   :END:
It's the internet! It won't cost you a penny to watch me perform. However,
right now, daft stuff like this is my only potential source of income, so
I would be deeply grateful if you could either [[https://ko-fi.com/pdcawley]["Buy me a coffee"]] via Ko-Fi
or [[https://twitch.tv/signup][sign up]] for a free Twitch account and subscribe to my channel.

*** Free money for your favourites!
    :PROPERTIES:
    :ID:       AFDB4ED1-8FAB-461B-816A-CD0BF60D7CC2
    :END:
If you are an Amazon Prime subscriber and you don't yet have a Twitch
Subscription, there's a wonderful thing you can do that means that Amazon
will give me (or any other streamer you enjoy) some money and it won't
cost you a penny. [[https://twitch.amazon.com/prime][Sign up]] for Twitch Prime, which is just like a regular
twitch account, but you can subscribe to one channel for free each month.
The streamer gets paid by Twitch as if you'd signed up for a regular
subscription, but you don't get charged a penny because you're already
paying Amazon for your Prime account. The only difference between a Prime
subscription and a regular one on Twitch is that you can't set up a Prime
sub to renew. If you would like to keep making regular payments to the
streamer of your choice, you need to remember to resubscribe every month.

*** One off tips
    :PROPERTIES:
    :ID:       95E39426-BE56-4078-9BF5-E7B2BE229683
    :END:
A Ko-Fi coffee comes in at £3, but if you want to tip me or any other
twitch performer with an arbitrary amount, then Twitch Bits are your
friend. You buy 'em from [[https://bits.twitch.tv/][Twitch]] and can then use them as a virtual
currency. For the performer, 100 bits is equivalent to $1, but they will
cost you more than that to buy, because Twitch are (understandably, it's
not a cheap platform to run!) going to have to take a cut somewhere. By
loading it on the cost of bits to the giver, they make things really
transparent. It's not like the weird alchemy where you pay a music
streaming site 69p for a track or whatever and, unbeknownst to you unless
you really dig into it, the artist sees maybe 6p of that.

Other performers have other ways for you to support them, whether it be
public amazon wishlist, paypal tip jar, patreon page or some other service
I've not heard of yet. In some ways, it's never been easier for you to
support the work of artists you love.


