content/post/virtual-gig-like-thing.md
+++
title = "My Virtual Gig-Like Thing"
author = ["Piers Cawley"]
date = 2020-04-08
lastmod = 2020-04-08T16:34:04+01:00
slug = "virtual-gig-like-thing"
draft = false
+++

On Thursday the 9th of April at 7pm UK time, I'm streaming my first attempt
at a  full folk club style gig from my study to my
[Twitch stream](https://twitch.tv/telear) and I would  love for you to be there.


## Schedule {#schedule}

It all kicks off at 7pm, UK time with a kind of Q&A session and
introduction to Twitch for newcomers. I'm particurly planning to help
other independent musicians reach their audience through the platform.[^fn:1]

Then, I plan to follow the Royal Traditions/Singing Together format of two
forty minute sets of folk material with a 10 minute refreshment and raffle
break in the middle.

After the folk club concert I'll be jumping onto [Twitch Sings](https://twitch.tv/sings/download/) to round out
the evening singing implausible songs with friends from that community and
any folky friends who've managed to get themselves up on Twitch by then. I'm
hoping it'll be a lot of fun.


## Ticket Prices {#ticket-prices}

It's the internet! It won't cost you a penny to watch me perform. However,
right now, daft stuff like this is my ownly potential source of income, so
I would be deeply grateful if you could either ["Buy me a coffee"](https://ko-fi.com/pdcawley) via Ko-Fi
or [sign up](https://twitch.tv/signup) for a free Twitch account and subscribe to my channel.


### Free money for your favourites! {#free-money-for-your-favourites}

If you are an Amazon Prime subscriber and you don't yet have a Twitch
Subscription, there's a wonderful thing you can do that means that Amazon
will give me (or any other streamer you enjoy) some money and it won't
cost you a penny. [Sign up](https://twitch.amazon.com/prime) for Twitch Prime, which is just like a regular
twitch account, but you can subscribe to one channel for free each month.
The streamer gets paid by Twitch as if you'd signed up for a regular
subscription, but you don't get charged a penny because you're already
paying Amazon for your Prime account. The only difference between a Prime
subscription and a regular one on Twitch is that you can't set up a Prime
sub to renew. If you would like to keep making regular payments to the
streamer of your choice, you need to remember to resubscribe every month.


### One off tips {#one-off-tips}

A Ko-Fi coffee comes in at £3, but if you want to tip me or any other
twitch performer with an arbitrary amount, then Twitch Bits are your
friend. You buy 'em from [Twitch](https://bits.twitch.tv/) and can then use them as a virtual
currency. For the performer, 100 bits is equivalent to $1, but they will
cost you more than that to buy, because Twitch are (understandably, it's
not a cheap platform to run!) going to have to take a cut somewhere. By
loading it on the cost of bits to the giver, they make things really
transparent. It's not like the weird alchemy where you pay a music
streaming site 69p for a track or whatever and, unbeknownst to you unless
you really dig into it, the artist sees maybe 6p of that.

Other performers have other ways for you to support them, whether it be
public amazon wishlist, paypal tip jar, patreon page or some other service
I've not heard of yet. In some ways, it's never been easier for you to
support the work of artists you love.

[^fn:1]: Recent deals with [SoundCloud](https://soundcloud.com) have made it _much_ easier for experienced performers to access the means to get paid on Twitch, and it seems to be the most transparent platform for getting paid.
